dany994/vak-opensource/trunk/microcontrollers/pic32sim/mx.c
/*
 * Simulate the peripherals of PIC32 microcontroller.
 *
 * Copyright (C) 2014 Serge Vakulenko, <serge@vak.ru>
 *
 * Permission to use, copy, modify, and distribute this software
 * and its documentation for any purpose and without fee is hereby
 * granted, provided that the above copyright notice appear in all
 * copies and that both that the copyright notice and this
 * permission notice and warranty disclaimer appear in supporting
 * documentation, and that the name of the author not be used in
 * advertising or publicity pertaining to distribution of the
 * software without specific, written prior permission.
 *
 * The author disclaim all warranties with regard to this
 * software, including all implied warranties of merchantability
 * and fitness.  In no event shall the author be liable for any
 * special, indirect or consequential damages or any damages
 * whatsoever resulting from loss of use, data or profits, whether
 * in an action of contract, negligence or other tortious action,
 * arising out of or in connection with the use or performance of
 * this software.
 */
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <unistd.h>
#include "globals.h"
#include "vtty.h"

#define PIC32MX7
#include "pic32mx.h"

#define STORAGE(name) case name: *namep = #name;
#define READONLY(name) case name: *namep = #name; goto readonly
#define WRITEOP(name) case name: *namep = #name; goto op_##name;\
                      case name+4: *namep = #name"CLR"; goto op_##name;\
                      case name+8: *namep = #name"SET"; goto op_##name;\
                      case name+12: *namep = #name"INV"; op_##name: \
                      *bufp = write_op (*bufp, data, address)
#define WRITEOPX(name,label) \
		      case name: *namep = #name; goto op_##label;\
                      case name+4: *namep = #name"CLR"; goto op_##label;\
                      case name+8: *namep = #name"SET"; goto op_##label;\
                      case name+12: *namep = #name"INV"; goto op_##label
#define WRITEOPR(name,romask) \
                      case name: *namep = #name; goto op_##name;\
                      case name+4: *namep = #name"CLR"; goto op_##name;\
                      case name+8: *namep = #name"SET"; goto op_##name;\
                      case name+12: *namep = #name"INV"; op_##name: \
                      *bufp &= romask; \
                      *bufp |= write_op (*bufp, data, address) & ~(romask)

#define VALUE(name) (name & 0x80000 ? iomem2 : iomem) [(name & 0xffff) >> 2]

static uint32_t *iomem;         // image of I/O area
static uint32_t *iomem2;        // image of second I/O area
static uint32_t *bootmem;       // image of boot memory

static unsigned syskey_unlock;	// syskey state

/*-------------------------------------------------------------------------
 * UART
 */
#define NUM_UART        6               // number of UART ports
#define UART_IRQ_ERR    0               // error irq offset
#define UART_IRQ_RX     1               // receiver irq offset
#define UART_IRQ_TX     2               // transmitter irq offset

static unsigned uart_irq[NUM_UART] = {  // UART interrupt numbers
    PIC32_IRQ_U1E,
    PIC32_IRQ_U2E,
    PIC32_IRQ_U3E,
    PIC32_IRQ_U4E,
    PIC32_IRQ_U5E,
    PIC32_IRQ_U6E,
};
static int uart_oactive[NUM_UART];      // UART output active
static unsigned uart_sta[NUM_UART] =    // UxSTA address
    { U1STA, U2STA, U3STA, U4STA, U5STA, U6STA };
static unsigned uart_mode[NUM_UART] =    // UxMODE address
    { U1MODE, U2MODE, U3MODE, U4MODE, U5MODE, U6MODE };

/*-------------------------------------------------------------------------
 * SPI
 */
#define NUM_SPI         4               // number of SPI ports
#define SPI_IRQ_FAULT   0               // error irq offset
#define SPI_IRQ_TX      1               // transmitter irq offset
#define SPI_IRQ_RX      2               // receiver irq offset

static unsigned spi_irq[NUM_SPI] = {    // SPI interrupt numbers
    PIC32_IRQ_SPI1E,
    PIC32_IRQ_SPI2E,
    PIC32_IRQ_SPI3E,
    PIC32_IRQ_SPI4E,
};
static unsigned spi_buf[NUM_SPI][4];    // SPI transmit and receive buffer
static unsigned spi_rfifo[NUM_SPI];     // SPI read fifo counter
static unsigned spi_wfifo[NUM_SPI];     // SPI write fifo counter
static unsigned spi_con[NUM_SPI] =      // SPIxCON address
    { SPI1CON, SPI2CON, SPI3CON, SPI4CON };
static unsigned spi_stat[NUM_SPI] =     // SPIxSTAT address
    { SPI1STAT, SPI2STAT, SPI3STAT, SPI4STAT };

static unsigned sdcard_port;    // SPI port number of SD card

/*
 * PIC32MX7 specific table:
 * translate IRQ number to interrupt vector.
 */
static const int irq_to_vector[] = {
    PIC32_VECT_CT,      /* 0  - Core Timer Interrupt */
    PIC32_VECT_CS0,     /* 1  - Core Software Interrupt 0 */
    PIC32_VECT_CS1,     /* 2  - Core Software Interrupt 1 */
    PIC32_VECT_INT0,    /* 3  - External Interrupt 0 */
    PIC32_VECT_T1,      /* 4  - Timer1 */
    PIC32_VECT_IC1,     /* 5  - Input Capture 1 */
    PIC32_VECT_OC1,     /* 6  - Output Compare 1 */
    PIC32_VECT_INT1,    /* 7  - External Interrupt 1 */
    PIC32_VECT_T2,      /* 8  - Timer2 */
    PIC32_VECT_IC2,     /* 9  - Input Capture 2 */
    PIC32_VECT_OC2,     /* 10 - Output Compare 2 */
    PIC32_VECT_INT2,    /* 11 - External Interrupt 2 */
    PIC32_VECT_T3,      /* 12 - Timer3 */
    PIC32_VECT_IC3,     /* 13 - Input Capture 3 */
    PIC32_VECT_OC3,     /* 14 - Output Compare 3 */
    PIC32_VECT_INT3,    /* 15 - External Interrupt 3 */
    PIC32_VECT_T4,      /* 16 - Timer4 */
    PIC32_VECT_IC4,     /* 17 - Input Capture 4 */
    PIC32_VECT_OC4,     /* 18 - Output Compare 4 */
    PIC32_VECT_INT4,    /* 19 - External Interrupt 4 */
    PIC32_VECT_T5,      /* 20 - Timer5 */
    PIC32_VECT_IC5,     /* 21 - Input Capture 5 */
    PIC32_VECT_OC5,     /* 22 - Output Compare 5 */
    PIC32_VECT_SPI1,    /* 23 - SPI1 Fault */
    PIC32_VECT_SPI1,    /* 24 - SPI1 Transfer Done */
    PIC32_VECT_SPI1,    /* 25 - SPI1 Receive Done */

    PIC32_VECT_U1     | /* 26 - UART1 Error */
    PIC32_VECT_SPI3   | /* 26 - SPI3 Fault */
    PIC32_VECT_I2C3,    /* 26 - I2C3 Bus Collision Event */

