dany994/vak-opensource/trunk/microcontrollers/pic32sim/mx.c
    PIC32_VECT_U1     | /* 27 - UART1 Receiver */
    PIC32_VECT_SPI3   | /* 27 - SPI3 Transfer Done */
    PIC32_VECT_I2C3,    /* 27 - I2C3 Slave Event */

    PIC32_VECT_U1     | /* 28 - UART1 Transmitter */
    PIC32_VECT_SPI3   | /* 28 - SPI3 Receive Done */
    PIC32_VECT_I2C3,    /* 28 - I2C3 Master Event */

    PIC32_VECT_I2C1,    /* 29 - I2C1 Bus Collision Event */
    PIC32_VECT_I2C1,    /* 30 - I2C1 Slave Event */
    PIC32_VECT_I2C1,    /* 31 - I2C1 Master Event */
    PIC32_VECT_CN,      /* 32 - Input Change Interrupt */
    PIC32_VECT_AD1,     /* 33 - ADC1 Convert Done */
    PIC32_VECT_PMP,     /* 34 - Parallel Master Port */
    PIC32_VECT_CMP1,    /* 35 - Comparator Interrupt */
    PIC32_VECT_CMP2,    /* 36 - Comparator Interrupt */

    PIC32_VECT_U3     | /* 37 - UART3 Error */
    PIC32_VECT_SPI2   | /* 37 - SPI2 Fault */
    PIC32_VECT_I2C4,    /* 37 - I2C4 Bus Collision Event */

    PIC32_VECT_U3     | /* 38 - UART3 Receiver */
    PIC32_VECT_SPI2   | /* 38 - SPI2 Transfer Done */
    PIC32_VECT_I2C4,    /* 38 - I2C4 Slave Event */

    PIC32_VECT_U3     | /* 39 - UART3 Transmitter */
    PIC32_VECT_SPI2   | /* 39 - SPI2 Receive Done */
    PIC32_VECT_I2C4,    /* 39 - I2C4 Master Event */

    PIC32_VECT_U2     | /* 40 - UART2 Error */
    PIC32_VECT_SPI4   | /* 40 - SPI4 Fault */
    PIC32_VECT_I2C5,    /* 40 - I2C5 Bus Collision Event */

    PIC32_VECT_U2     | /* 41 - UART2 Receiver */
    PIC32_VECT_SPI4   | /* 41 - SPI4 Transfer Done */
    PIC32_VECT_I2C5,    /* 41 - I2C5 Slave Event */

    PIC32_VECT_U2     | /* 42 - UART2 Transmitter */
    PIC32_VECT_SPI4   | /* 42 - SPI4 Receive Done */
    PIC32_VECT_I2C5,    /* 42 - I2C5 Master Event */

    PIC32_VECT_I2C2,    /* 43 - I2C2 Bus Collision Event */
    PIC32_VECT_I2C2,    /* 44 - I2C2 Slave Event */
    PIC32_VECT_I2C2,    /* 45 - I2C2 Master Event */
    PIC32_VECT_FSCM,    /* 46 - Fail-Safe Clock Monitor */
    PIC32_VECT_RTCC,    /* 47 - Real-Time Clock and Calendar */
    PIC32_VECT_DMA0,    /* 48 - DMA Channel 0 */
    PIC32_VECT_DMA1,    /* 49 - DMA Channel 1 */
    PIC32_VECT_DMA2,    /* 50 - DMA Channel 2 */
    PIC32_VECT_DMA3,    /* 51 - DMA Channel 3 */
    PIC32_VECT_DMA4,    /* 52 - DMA Channel 4 */
    PIC32_VECT_DMA5,    /* 53 - DMA Channel 5 */
    PIC32_VECT_DMA6,    /* 54 - DMA Channel 6 */
    PIC32_VECT_DMA7,    /* 55 - DMA Channel 7 */
    PIC32_VECT_FCE,     /* 56 - Flash Control Event */
    PIC32_VECT_USB,     /* 57 - USB */
    PIC32_VECT_CAN1,    /* 58 - Control Area Network 1 */
    PIC32_VECT_CAN2,    /* 59 - Control Area Network 2 */
    PIC32_VECT_ETH,     /* 60 - Ethernet Interrupt */
    PIC32_VECT_IC1,     /* 61 - Input Capture 1 Error */
    PIC32_VECT_IC2,     /* 62 - Input Capture 2 Error */
    PIC32_VECT_IC3,     /* 63 - Input Capture 3 Error */
    PIC32_VECT_IC4,     /* 64 - Input Capture 4 Error */
    PIC32_VECT_IC5,     /* 65 - Input Capture 5 Error */
    PIC32_VECT_PMP,     /* 66 - Parallel Master Port Error */
    PIC32_VECT_U4,      /* 67 - UART4 Error */
    PIC32_VECT_U4,      /* 68 - UART4 Receiver */
    PIC32_VECT_U4,      /* 69 - UART4 Transmitter */
    PIC32_VECT_U6,      /* 70 - UART6 Error */
    PIC32_VECT_U6,      /* 71 - UART6 Receiver */
    PIC32_VECT_U6,      /* 72 - UART6 Transmitter */
    PIC32_VECT_U5,      /* 73 - UART5 Error */
    PIC32_VECT_U5,      /* 74 - UART5 Receiver */
    PIC32_VECT_U5,      /* 75 - UART5 Transmitter */
};

void update_irq_flag()
{
    /* Assume no interrupts pending. */
    int cause_ripl = 0;
    int vector = 0;
    VALUE(INTSTAT) = 0;

    if ((VALUE(IFS0) & VALUE(IEC0)) ||
        (VALUE(IFS1) & VALUE(IEC1)) ||
        (VALUE(IFS2) & VALUE(IEC2)))
    {
        /* Find the most prioritive pending interrupt,
         * it's vector and level. */
        int irq;
        for (irq=0; irq<sizeof(irq_to_vector)/sizeof(int); irq++) {
            int n = irq >> 5;

            if ((VALUE(IFS(n)) & VALUE(IEC(n))) >> (irq & 31) & 1) {
                /* Interrupt is pending. */
                int v = irq_to_vector [irq];
                if (v < 0)
                    continue;

                int level = VALUE(IPC(v >> 2));
                level >>= 2 + (v & 3) * 8;
                level &= 7;
                if (level > cause_ripl) {
                    vector = v;
                    cause_ripl = level;
                }
            }
        }
        VALUE(INTSTAT) = vector | (cause_ripl << 8);
//printf ("-- vector = %d, level = %d\n", vector, level);
    }
//else printf ("-- no irq pending\n");

    eic_level_vector (cause_ripl, vector);
}

/*
 * Set interrupt flag status
 */
void set_irq (int irq)
{
    VALUE(IFS(irq >> 5)) |= 1 << (irq & 31);
    update_irq_flag();
}

/*
 * Clear interrupt flag status
 */
void clear_irq (int irq)
{
    VALUE(IFS(irq >> 5)) &= ~(1 << (irq & 31));
    update_irq_flag();
}

static void soft_reset()
{
    //TODO
#if 0
    mips_reset();
    cpu->pc = pic32->start_address;

    /* reset all devices */
    reset_all();
    sdcard_reset();
#endif
}

static unsigned uart_get_char (int port)
{
    unsigned value;

    // Read a byte from input queue
    value = vtty_get_char (port);
    VALUE(uart_sta[port]) &= ~PIC32_USTA_URXDA;

    if (vtty_is_char_avail (port)) {
        // One more byte available
        VALUE(uart_sta[port]) |= PIC32_USTA_URXDA;
    } else {
        clear_irq (uart_irq[port] + UART_IRQ_RX);
    }
    return value;
}

static void uart_poll_status (int port)
{
    // Keep receiver idle, transmit shift register always empty
    VALUE(uart_sta[port]) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;

    if (vtty_is_char_avail (port)) {
        // Receive data available
        VALUE(uart_sta[port]) |= PIC32_USTA_URXDA;
    }
    //printf ("<%x>", VALUE(uart_sta[port])); fflush (stdout);
}

static void uart_put_char (int port, unsigned data)
{
    vtty_put_char (port, data);
    if ((VALUE(uart_mode[port]) & PIC32_UMODE_ON) &&
        (VALUE(uart_sta[port]) & PIC32_USTA_UTXEN) &&
        ! uart_oactive[port])
    {
        uart_oactive[port] = 1;
        set_irq (uart_irq[port] + UART_IRQ_TX);
    }
}

static void uart_update_mode (int port)
{
    if (! (VALUE(uart_mode[port]) & PIC32_UMODE_ON)) {
        clear_irq (uart_irq[port] + UART_IRQ_RX);
        clear_irq (uart_irq[port] + UART_IRQ_TX);
        VALUE(uart_sta[port]) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                                   PIC32_USTA_PERR | PIC32_USTA_UTXBF);
        VALUE(uart_sta[port]) |= PIC32_USTA_RIDLE | PIC32_USTA_TRMT;
    }
}

static void uart_update_status (int port)
{
    if (! (VALUE(uart_sta[port]) & PIC32_USTA_URXEN)) {
        clear_irq (uart_irq[port] + UART_IRQ_RX);
        VALUE(uart_sta[port]) &= ~(PIC32_USTA_URXDA | PIC32_USTA_FERR |
                                   PIC32_USTA_PERR);
    }
    if (! (VALUE(uart_sta[port]) & PIC32_USTA_UTXEN)) {
        clear_irq (uart_irq[port] + UART_IRQ_TX);
        VALUE(uart_sta[port]) &= ~PIC32_USTA_UTXBF;
        VALUE(uart_sta[port]) |= PIC32_USTA_TRMT;
    }
}

unsigned sdcard_io (unsigned data)
{
    //TODO
    return 0;
}

static void spi_writebuf (int port, unsigned val)
{
    /* Perform SD card i/o on configured SPI port. */
    if (port == sdcard_port) {
        unsigned result = 0;

        if (VALUE(spi_con[port]) & PIC32_SPICON_MODE32) {
            /* 32-bit data width */
            result  = (unsigned char) sdcard_io (val >> 24) << 24;
            result |= (unsigned char) sdcard_io (val >> 16) << 16;
            result |= (unsigned char) sdcard_io (val >> 8) << 8;
            result |= (unsigned char) sdcard_io (val);

